Label on edges of diagrams
